#coding:utf-8
#Author:Zhiqiang Yuan
#这个文件为英语记录程序，运行后首先输入记录的词，接着输入记录的含义，按Q退出，否则继续记录

import EDB

print("++++++++++++++++++++++++++++++++++++++++++++++++++")
print("            欢迎使用小袁单词记录系统！")
print("++++++++++++++++++++++++++++++++++++++++++++++++++")

while(True):
    word = input("请输入需要记录的单词：\n")
    mean = input("请输入该单词的含义：\n")
    sentence = input("请使用该单词造个句：\n")

    print("+------------------------------------------------+")
    print("您所记录的单词如下：")
    print("单词:",word)
    print("含义:", mean)
    print("造句:", sentence)
    EDB.insert(word=word, mean=mean, sentence=sentence)
    print("+------------------------------------------------+")

    print("记录完成！q退出，d删除上一条记录，按其他任意键继续记录。")
    print("+------------------------------------------------+")

    Key=input()
    if Key=="q":
        break
    elif Key=="d":
        EDB.delete_last()
        print("删除完成！q退出,按其他任意键继续记录。")
        Key = input()
        if Key == "q":
            break
        else:
            print("+------------------------------------------------+")
    else:
        print("+------------------------------------------------+")

print("++++++++++++++++++++++++++++++++++++++++++++++++++")
print("            小袁单词欢迎您的再次使用！")
print("++++++++++++++++++++++++++++++++++++++++++++++++++")

